package ru.rubicon.client.model.odata;

/**
 * Created by Admin on 30.12.2016.
 */

public class ShipmentOrder {
}
/*
{
"odata.metadata": "http://moon/Test/odata/standard.odata/$metadata#Document_ПриходныйОрдер",
"value": [{
"Ref_Key": "b1c89d94-cb6a-11e6-aede-5404a6b4b8ed",
"DataVersion": "AAAAAQAAAAA=",
"DeletionMark": false,
"Number": "000000001",
"Date": "2016-12-26T16:00:52",
"Posted": false,
"ВидОперации": "Покупка",
"Склад_Key": "3aa3cd58-c109-11e6-a7a6-5404a6b4b8ed",
"Контрагент_Key": "b1c89d93-cb6a-11e6-aede-5404a6b4b8ed",
"НомерКонтракта": "           ",
"ДатаКонтракта": "0001-01-01T00:00:00",
"Комментарий": "",
"Подразделение_Key": "b837edfd-c36d-11e6-aede-5404a6b4b8ed",
"РабочийЦентр_Key": "b837edff-c36d-11e6-aede-5404a6b4b8ed",
"Ответственный_Key": "4b990e7f-c046-11e6-9160-5404a6b4b8ed",
"ОкончаниеОприходованиеКонтракта": false,
"ДокументОснование_Key": "00000000-0000-0000-0000-000000000000",
"ПриходоватьТоварПоСериям": false,
"Товары": [
{
"Ref_Key": "b1c89d94-cb6a-11e6-aede-5404a6b4b8ed",
"LineNumber": "1",
"Номенклатура_Key": "00000000-0000-0000-0000-000000000000",
"Количество": 0,
"ЕдиницаИзмерения_Key": "00000000-0000-0000-0000-000000000000",
"Качество_Key": "00000000-0000-0000-0000-000000000000",
"ШтрихКод": "                    ",
"МестоХранения_Key": "00000000-0000-0000-0000-000000000000",
"СпособТранспортировки_Key": "00000000-0000-0000-0000-000000000000",
"ЭлементСтруктурыХранения_Key": "00000000-0000-0000-0000-000000000000",
"СерийныйНомер": "",
"Подобран": false,
"СпособПодбораМеста": "",
"Кладовщик_Key": "00000000-0000-0000-0000-000000000000"
}
],
"Излишки": [],
"Недостача": [],
"Контроль": [],
"Стеллажи": [],
"Склад@navigationLinkUrl": "Document_ПриходныйОрдер(guid'b1c89d94-cb6a-11e6-aede-5404a6b4b8ed')/Склад",
"Контрагент@navigationLinkUrl": "Document_ПриходныйОрдер(guid'b1c89d94-cb6a-11e6-aede-5404a6b4b8ed')/Контрагент",
"Подразделение@navigationLinkUrl": "Document_ПриходныйОрдер(guid'b1c89d94-cb6a-11e6-aede-5404a6b4b8ed')/Подразделение",
"РабочийЦентр@navigationLinkUrl": "Document_ПриходныйОрдер(guid'b1c89d94-cb6a-11e6-aede-5404a6b4b8ed')/РабочийЦентр",
"Ответственный@navigationLinkUrl": "Document_ПриходныйОрдер(guid'b1c89d94-cb6a-11e6-aede-5404a6b4b8ed')/Ответственный"
}]}
 */